<?php
/**
 * 音乐管理系统
 *
 * @version   2.0
 * @author    战神~~巴蒂 [jyuucn@163.com]
 * @license   http://jyuu.cn [未经授权严禁私自出售，否者承担法律责任]
 * @copyright 2014 - 2017
 */
return [
    /** 模板语言 */
    'music' => '音乐',
    'top_music' => '讲道TOP',
    'latest_music' => '最新添加',
    'hot_listen' => '热门试听',
    'hot_down' => '热门下载',
    'recommend_music' => '推荐单曲',
    
    'album' => '专辑',
    'latest_album' => '新碟上架',
    'recommend_album' => '推荐专辑',
    
    'artist' => '音乐人',
    'latest_artist' => '新晋音乐人',
    'recommend_artist' => '推荐音乐人',
    
    'genre' => '音乐分类',
    'recommend_genre' => '分类精选',
    
    'ranks' => '音乐排行榜单',
    'recommend_ranks' => '推荐音乐榜单',
    
    'tags' => '音乐风格',
    'recommend_tags' => '推荐音乐风格',
    
    'user' => '用户',
    'share_user' => '分享达人',
    
    'friend_link' => '友情链接',
    'more' => '更多',

	/**信息提示 **/
	'login_success' => '登录成功',
	'signup_success' => '注册成功',
	'pwd_rest_success' => '密码重置成功',
    'signup_off'  => '抱歉，当前站点用户注册已关闭',
	'active_email_success'  => '系统已发送激活邮件，请前往你的邮箱查看并在24小时内激活',
	'email_vcode_success' => '验证码获取成功，请前往你的邮箱查看！',
	'active_error' => '激活地址不正确或已过期！',
	'active_success' => '用户激活成功！',
	'logout_success' => '成功退出登录',
    
    /** 上传文件 */
	'file_upload_success' => '文件上传成功',
	'audio_upload_success' => '音频文件上传成功',
	'image_upload_success' => '图片文件上传成功',
	'avatar_upload_success' => '头像上传成功',
    'file_upload_error' => '文件上传失败',
    'audio_upload_error' => '音频文件上传失败',
    'image_upload_error' => '图片文件上传失败',
    'avatar_upload_error' => '头像上传失败',
    
    //400*** api 参数验证错误返回的信息
	/*返回状态*/
	404 => '你访问的页面不存在', //404 not found
	401 => '未授权', //Unauthorized
	403 => '禁止访问', //Forbidden
	500 => '服务内部错误', //Internal Server Error
	
 
	//已下是 api 对应语言
	40004 => '参数错误',

	//操作限制错误码
	40011 => '收藏数量已达上限',
	40012 => '关注数量已达上限',
	40013 => '本月头像上传次数已达上限',
	40014 => '本月资料修改次数已达上限',
	40015 => '本月密码修改次数已达上限',
	40016 => '自己无法关注自己',

	//文件错误码
    40020 => 'PHP 文件上传扩展没有开启',
    40021 => '上传的文件大小超过了 php.ini 中 upload_max_filesize 设置的值。',
    40022 => '上传的文件大小超过了 HTML 表单设置的大小。',
    40023 => '上传的文件部分丢失。',
    40024 => '上传文件丢失。',
    40026 => '缺少一个临时文件夹',
    40027 => '目标文件目录不存在或不可读，不能进行处理。',
    40028 => 'A PHP extension stopped the file upload',
    40029 => '文件上传选项在 php.ini 中被禁用',
    
    400201 => '上传文件大小超过了 php.ini 中 post_max_size 设置的值',
    400202 => '上传文件数量超过了 php.ini 中 max_file_uploads 设置的值',
    400203 => '没有上传的文件',
    400204 => '没有选择文件，请选择一个',
    400206 => '上传文件后缀不允许！',
    400207 => '文件大小超过限制',
    400208 => '文件上传数量超过限制',
    400209 => '文件只有部分被上传！',
    400210 => '文件写入磁盘失败，请检查目录权限',
    400211 => '文件目录创建失败，请检查目录权限',
    400212 => '非法上传文件',
    400213 => '法图像文件！',
    400214 => '文件下载失败',

	//验证错误
	40030 => '参数验证错误',
	40031 => '用户名错误',
	40032 => '邮箱格式错误',
	40033 => '密码错误',
	40034 => '手机号错误',
	40035 => '验证码错误',
	40036 => '验证码已过期',
	40037 => 'token令牌无效',
	40038 => '重复登录',

	//账号相关错误
	40040 => '用户不存在',
	40041 => '账号已经激活',
	40044 => '账号已被禁用',
	40045 => '邮箱不存在，请确认输入是否正确',

	//服务状态错误码
	40401 => '抱歉你还没有登录，请登录',
	40403 => '没有权限访问',
	40404 => '操作的类型不存在',
	40405 => '操作过于频繁，请慢点',
	40406 => '短时间内无法操作，请慢点',
	40407 => '暂时没有数据',

	//服务内存程序出错
	40500 => '抱歉操作失败，请稍后重试',
	40501 => '用户注册失败，请稍后重试',
	40502 => '用户登录失败，请稍后重试',
	40503 => '激活邮件发送失败，请稍后重试',
	40504 => '验证码获取失败，请稍后重试',
	40505 => '退出登录失败，请稍后重试',
	40506 => '文件上传失败，请稍后重试',
]; 